//Задача №8: Цикличный вывод данных на экран Задание
//Необходимо с помощью цикла вывести на экран числа от 1 до 50.

package homework;

public class FromOneToFifty {
    public void fromOneToFifty(){
        for (int i = 1; i < 51; i++) {
            System.out.println(i);
        }
    }
}
